{
  "backend/main.mo": "Motoko canister implementing orders, user profiles, role assignment, and authorization with storage mixins and ensureUserRole bootstrap.",
  "backend/old.mo": "Legacy module defining earlier Order, UserProfile, and state structures for reference or migration.",
  "feature_evidence.json": "Feature evidence report listing implemented frontend features, associated files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend files describing their functionality and roles in the app.",
  "frontend/DEPLOYMENT.md": "Comprehensive deployment guide for backend on Internet Computer and frontend on cPanel with configuration and troubleshooting.",
  "frontend/index.css": "Global Tailwind-based styles defining color tokens, light/dark themes, and base layout rules.",
  "frontend/index.html": "Static HTML entry point loading the React application via main.tsx.",
  "frontend/public/.htaccess": "Optional Apache config enabling compression, caching, MIME types, and security headers for static hosting.",
  "frontend/public/DEPLOYMENT.md": "Guide for hosting only the frontend on cPanel while backend remains on the Internet Computer.",
  "frontend/src/App.tsx": "Main app component with hash-based routing, authentication state, admin link logic, and layout structure.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Wrapper enforcing admin access with loading, error, login, and denial states.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "Admin form for updating payment/contact status and notes with validation and submission.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button handling Internet Identity auth and query invalidation.",
  "frontend/src/components/LoginRequiredScreen.tsx": "UI screen prompting the user to log in before accessing protected actions.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component supporting drawing, clearing, and touch events.",
  "frontend/src/hooks/useActor.ts": "Creates and manages authenticated/anonymous backend actor and invalidates dependent queries.",
  "frontend/src/hooks/useAdmin.ts": "Hook to check admin status using actor, handling loading, errors, and retry logic.",
  "frontend/src/hooks/useEnsureUserRole.ts": "Ensures the authenticated user has the user role, running once per principal and invalidating related queries on success.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity loading, and AuthClient setup.",
  "frontend/src/hooks/useOrders.ts": "Contains React Query hooks for submitting orders and fetching or updating order data via the backend actor.",
  "frontend/src/hooks/useProfile.ts": "Offers hooks to fetch and update the caller's user profile, ensuring roles and refreshing related queries.",
  "frontend/src/index.css": "Tailwind-based global styles defining color variables, typography, layout rules, and dark mode variants.",
  "frontend/src/main.tsx": "App entry point that mounts React, setting up QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin page that loads a single order, displays its details, photos, and signature, and allows updating payment contact status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin dashboard listing all orders with search, filters, statistics, and navigation to individual order details.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying a hero banner, product highlights, and navigation to ordering and pricing.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays a list of the user's orders, requires authentication, and shows detailed order info when one is selected.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows an order confirmation screen with payment contact instructions and displays the order ID.",
  "frontend/src/pages/OrderPage.tsx": "Presents an authenticated order submission form with validation, photo/signature upload, and form field management.",
  "frontend/src/pages/PricesPage.tsx": "Displays pricing details, feature highlights, and a call-to-action to start an order.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and update their profile information and checks for admin access.",
  "frontend/src/utils/assetPaths.ts": "Generates base-path-safe URLs for static assets and documents using the build’s BASE_URL.",
  "frontend/src/utils/errorFormatting.ts": "Formats errors into readable messages, redacts sensitive data, and extracts backend-specific error details.",
  "frontend/src/utils/fileValidation.ts": "Validates uploaded image files for type and size and converts files to byte arrays.",
  "frontend/src/utils/idGenerators.ts": "Generates random names and addresses using local predefined lists.",
  "frontend/src/utils/orderFormatting.ts": "Formats backend timestamps and order/payment statuses into readable strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL parameters, including hash-based routing support.",
  "frontend/src/utils/usStates.ts": "Exports a static list of US states for form dropdowns.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines project metadata, issues, and feature requirements related to ensuring ensureUserRole() is called after authentication."
}