{
  "backend/main.mo": "Main backend canister implementing access control, user profiles, order submission, and user-role bootstrap with storage and authorization mixins.",
  "backend/migration.mo": "Migration module defining old/new actor state types and a no-op migration that returns the existing state.",
  "backend/old.mo": "Historical actor/state definitions for the previous backend version, including older order and signature types.",
  "feature_evidence.json": "Feature evidence report describing frontend auto-invocation of ensureUserRole and related components and tests.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend source files used for build or documentation purposes.",
  "frontend/DEPLOYMENT.md": "Full deployment guide explaining backend canister deployment and frontend cPanel hosting setup.",
  "frontend/index.css": "Tailwind base styles with custom OKLCH color variables and dark-mode theme definitions.",
  "frontend/index.html": "HTML entry point mounting the root element and loading the main frontend bundle.",
  "frontend/public/.htaccess": "Optional Apache configuration for compression, caching, security headers, and MIME types for static hosting.",
  "frontend/public/DEPLOYMENT.md": "Guide for hosting the frontend on cPanel and explaining architecture and upload steps.",
  "frontend/src/App.tsx": "Main app component handling hash-based routing, authentication state, admin link visibility, and rendering top-level pages.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Gate component that checks admin authentication and conditionally renders loading, error, denial, or protected admin content.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "Admin UI for viewing and updating payment/contact status and notes for an order.",
  "frontend/src/components/LoginButton.tsx": "A login/logout button that manages Internet Identity authentication state and handles login errors.",
  "frontend/src/components/LoginRequiredScreen.tsx": "Displays a login-required prompt with explanation and a login button for unauthenticated users.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component allowing drawing, clearing, and returning a PNG data URL.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the current identity, auto-refreshing dependent queries when the actor changes.",
  "frontend/src/hooks/useAdmin.ts": "Hook that checks whether the current authenticated actor has admin privileges, handling loading and error states.",
  "frontend/src/hooks/useEnsureUserRole.ts": "Ensures the authenticated user has the user role once per principal and refreshes related queries.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context with login, logout, identity loading, and auth-client initialization.",
  "frontend/src/hooks/useOrders.ts": "Defines hooks for submitting orders, fetching orders, and updating order or payment statuses using the backend actor.",
  "frontend/src/hooks/useProfile.ts": "Provides hooks to fetch and save the current user's profile, ensuring role assignment and updating cache states.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, typography, focus states, and layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider wrappers.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin view for loading an order, previewing uploaded assets, and updating payment contact status with validation and feedback.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin orders page that fetches, filters, searches, and displays orders with status and payment filtering and click handling.",
  "frontend/src/pages/HomePage.tsx": "Renders the landing page with a hero banner, navigation buttons, and feature overview sections.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the user's orders, login prompt if unauthenticated, and detailed order view with status badges.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays an order confirmation screen and automatically opens a modal with payment contact details and accepted payment methods.",
  "frontend/src/pages/OrderPage.tsx": "Provides a full order form with validation, ID info inputs, photo/signature upload, and submits the order after authentication.",
  "frontend/src/pages/PricesPage.tsx": "Shows pricing details, feature highlights, and quantity-based examples with a button to navigate to the order page.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and update their profile info and shows admin access options if applicable.",
  "frontend/src/utils/assetPaths.ts": "Provides helpers to build base-path-safe URLs for static assets and documents using BASE_URL.",
  "frontend/src/utils/fileValidation.ts": "Validates client-side image files for type and size and converts files to byte arrays.",
  "frontend/src/utils/idGenerators.ts": "Generates random names and US-style addresses using predefined lists and randomization.",
  "frontend/src/utils/orderFormatting.ts": "Formats backend time values and maps order and payment statuses to readable labels.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/usStates.ts": "Exports a constant list of US states with labels for dropdown use.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project state metadata describing role-assignment issues, fixes in progress, and related feature requests."
}