{
  "backend/main.mo": "Main backend canister defining order, user profile, authorization logic, and admin-restricted order management with storage and blob handling.",
  "backend/old.mo": "Legacy module containing earlier type definitions for orders, signatures, user profiles, and actor state.",
  "feature_evidence.json": "Feature evidence report mapping features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Collection of autogenerated summaries describing key frontend files and their roles in the application.",
  "frontend/DEPLOYMENT.md": "Comprehensive deployment guide explaining backend IC deployment and frontend cPanel hosting setup with configuration and troubleshooting.",
  "frontend/index.css": "Tailwind-based global stylesheet defining theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Base HTML entry point loading the React application root and main script.",
  "frontend/public/.htaccess": "Optional Apache configuration enabling compression, caching, security headers, and MIME types for static hosting.",
  "frontend/public/DEPLOYMENT.md": "Self-hosting guide detailing how to build and upload the frontend to cPanel and configure deployments.",
  "frontend/src/App.tsx": "Implements hash-based routing, authentication checks, and layout for the main app with navigation and page rendering.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "Admin form for viewing and updating payment contact status and notes with submit handling.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/LoginRequiredScreen.tsx": "Displays a card prompting the user to log in, explaining why authentication is required.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component allowing drawing, clearing, and emitting signature data URLs.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor, refreshing dependent queries on identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Fetches and exposes whether the current authenticated user has admin privileges.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context including login, logout, identity loading, and status tracking.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for submitting orders and fetching or updating order data via an actor API.",
  "frontend/src/index.css": "Defines Tailwind base layers and theme variables with light/dark mode styling and global UI styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with Internet Identity and React Query providers.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Displays detailed admin view of a single order, including status badges, customer data, file previews, and payment contact controls.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Shows an admin order list with search, filtering, stats, and navigation to individual order details.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero section, navigation buttons, and informational feature cards.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the user's orders, supports viewing individual order details, and requires authentication.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details and a payment contact modal after an order is submitted.",
  "frontend/src/pages/OrderPage.tsx": "Implements the full order form with validation, ID info inputs, photo/signature upload, and order submission.",
  "frontend/src/pages/PricesPage.tsx": "Renders the pricing page with a main pricing card, feature list, and tiered pricing examples, allowing navigation to the order page.",
  "frontend/src/utils/assetPaths.ts": "Provides helpers to generate base-path-safe URLs for static assets and documents.",
  "frontend/src/utils/fileValidation.ts": "Offers client-side image file validation and conversion utilities.",
  "frontend/src/utils/idGenerators.ts": "Generates random names and addresses using predefined lists and simple randomization.",
  "frontend/src/utils/orderFormatting.ts": "Formats backend order timestamps and status enums into readable strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and managing URL and session-based parameters, including hash routing support.",
  "frontend/src/utils/usStates.ts": "Exports a constant array of U.S. state abbreviations and names for use in dropdowns.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, animations, container settings, and plugins for typography, container queries, and animations.",
  "project_state.json": "Defines the project’s current state, including enabled features, new requests, and notes related to adding cPanel self‑hosting documentation and assets."
}