{
  "backend/main.mo": "Motoko canister implementing access‑controlled user profiles and order management with storage, ID info, and payment contact workflows.",
  "backend/old.mo": "Legacy types and structures defining older versions of orders, profiles, and canister state layout.",
  "feature_evidence.json": "Feature evidence report mapping three principal‑ID UI features to source files, components, tests, and confidence levels.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend source file for build and documentation reference.",
  "frontend/DEPLOYMENT.md": "Detailed deployment guide explaining how to deploy the backend canister and host the React frontend on cPanel.",
  "frontend/index.css": "Global Tailwind‑based style file defining color tokens, dark mode values, and base styling rules.",
  "frontend/index.html": "Base HTML entry file mounting the React app and loading the main TypeScript bundle.",
  "frontend/public/.htaccess": "Optional Apache config enabling compression, caching, security headers, and MIME rules for the static frontend.",
  "frontend/public/DEPLOYMENT.md": "Frontend‑only deployment guide for hosting the built React app on cPanel and connecting it to the IC backend.",
  "frontend/src/App.tsx": "Main app component handling hash-based routing, authentication state, admin checks, and profile gating.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Wrapper component enforcing admin access with states for login, loading, errors, and restoration.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "Admin form for updating payment/contact status and notes with validation and submit handling.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button that triggers Internet Identity auth and manages related query invalidation.",
  "frontend/src/components/LoginRequiredScreen.tsx": "UI screen prompting unauthenticated users to log in before placing orders.",
  "frontend/src/components/PrincipalIdFooterBlock.tsx": "Displays the authenticated user's principal ID with copy-to-clipboard support.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component with drawing, clearing, and data URL export.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor tied to the user's identity and invalidates dependent queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Provides a hook that checks if the authenticated caller is an admin using react-query with proper loading and error handling.",
  "frontend/src/hooks/useAdminRestore.ts": "Defines a mutation that restores admin access for the caller and invalidates related admin and profile queries.",
  "frontend/src/hooks/useEnsureUserRole.ts": "Ensures the authenticated user has the user role by invalidating and refetching related caches once per principal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity provider and hook managing login, logout, identity loading, and auth client configuration.",
  "frontend/src/hooks/useOrders.ts": "Contains hooks for submitting, fetching, and updating orders using actor methods with react-query cache invalidation.",
  "frontend/src/hooks/useProfile.ts": "Provides hooks to fetch and save the caller's user profile with appropriate query invalidation and admin refresh.",
  "frontend/src/hooks/useProfileGate.ts": "Determines if an authenticated user must complete profile setup based on identity and profile fetch state.",
  "frontend/src/index.css": "Defines Tailwind base styles, theme variables, dark mode values, typography rules, and global layout constraints.",
  "frontend/src/main.tsx": "Bootstraps the app by rendering React with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin page that loads a specific order, displays details including ID photos/signatures, and allows updating payment contact status.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin dashboard listing all orders with filters, search, stats, and navigation to individual order details.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with hero banner, about section, and navigation buttons for ordering and pricing.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the user's orders, handles authentication checks, and shows either a list of orders or detailed order view with statuses.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows confirmation details for a submitted order and automatically opens a payment-info modal.",
  "frontend/src/pages/OrderPage.tsx": "Provides a full order form with validation, file uploads, identity data, and submission logic requiring authentication.",
  "frontend/src/pages/PricesPage.tsx": "Shows pricing information, feature highlights, and sample tier cards with an option to navigate to the order page.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and edit their profile, checks admin access, and supports restoring admin privileges.",
  "frontend/src/utils/assetPaths.ts": "Utilities to generate base-path-safe URLs for static assets and documents.",
  "frontend/src/utils/errorFormatting.ts": "Functions to extract human-readable error messages and redact sensitive data, plus IC-specific backend error extraction.",
  "frontend/src/utils/fileValidation.ts": "Client-side image file validation and conversion utilities.",
  "frontend/src/utils/idGenerators.ts": "Local random generators for names and US-style addresses.",
  "frontend/src/utils/orderFormatting.ts": "Formatting helpers for order dates and readable status labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and cleaning URL parameters across routing modes.",
  "frontend/src/utils/usStates.ts": "Static list of US states for dropdown selection.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins including typography, container queries, and animate.",
  "project_state.json": "Describes the project’s state, existing features, and a new in‑progress request related to temporarily displaying a user’s principal ID."
}