{
  "backend/main.mo": "Main canister defining order, user profile, and access-control logic with functions for profile management and order submission.",
  "backend/migration.mo": "Migration module passing through old actor state to new actor format without transformation.",
  "backend/old.mo": "Old actor state definition including legacy order structure with signature instead of full ID info.",
  "feature_evidence.json": "Feature evidence report linking a specific admin-panel reliability feature to affected frontend files and components.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/DEPLOYMENT.md": "Comprehensive deployment guide explaining how to deploy the backend to the Internet Computer and the frontend to cPanel.",
  "frontend/index.css": "Global Tailwind-based styles defining theme variables, dark mode tokens, and base element styling.",
  "frontend/index.html": "Base HTML document loading the React application entry point.",
  "frontend/public/.htaccess": "Optional Apache configuration enabling compression, caching, security headers, and MIME fixes for cPanel hosting.",
  "frontend/public/DEPLOYMENT.md": "Frontend-only deployment guide for hosting the React build on cPanel while connecting to the IC backend.",
  "frontend/src/App.tsx": "Implements hash-based routing, authentication-aware navigation, and admin link logic for rendering main pages.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Gates admin-only content with login checks, admin verification, and error or denial screens.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "Admin form for updating an order’s payment/contact status and notes with validation and submit handling.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with handling for login state and errors.",
  "frontend/src/components/LoginRequiredScreen.tsx": "Displays a card prompting unauthenticated users to log in before ordering.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component allowing draw, clear, and data URL export.",
  "frontend/src/hooks/useActor.ts": "Creates and caches a backend actor tied to Internet Identity, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Fetches and caches whether the current authenticated user is an admin via the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for managing Internet Identity authentication, including loading, login, logout, and status handling via AuthClient.",
  "frontend/src/hooks/useOrders.ts": "Defines React Query hooks for submitting orders and fetching or updating order data through the backend actor.",
  "frontend/src/hooks/useProfile.ts": "Implements hooks for retrieving and updating the caller's user profile, with identity-aware cache invalidation.",
  "frontend/src/index.css": "Tailwind-based global styles defining theme variables, dark mode, typography, transitions, and layout rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider before rendering App.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin-only page that loads order details, displays uploaded photo/signature, and allows updating payment contact status. Handles loading states and missing orders.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin orders dashboard that fetches all orders, applies filters and search, computes stats, and displays results with UI components.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with a hero section, navigation buttons, and feature highlights.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the user's orders, showing a login prompt when unauthenticated and detailed order info when selected.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays order confirmation details and automatically opens a modal with payment contact instructions. Shows order ID and confirmation messaging.",
  "frontend/src/pages/OrderPage.tsx": "Provides a full order form with validation, ID info entry, photo upload, signature capture, and order submission. Requires authentication before allowing order creation.",
  "frontend/src/pages/PricesPage.tsx": "Shows pricing information, included features, and sample quantity tiers. Provides navigation to the order page.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and edit their profile information with validation and save functionality. Checks admin access and displays loading or login screens as needed.",
  "frontend/src/utils/assetPaths.ts": "Provides helpers to generate base-path-safe URLs for static assets and documents using the app's BASE_URL.",
  "frontend/src/utils/fileValidation.ts": "Validates image file type and size and includes a utility to convert files to byte arrays.",
  "frontend/src/utils/idGenerators.ts": "Generates random full names and US-style addresses using local lists and number helpers.",
  "frontend/src/utils/orderFormatting.ts": "Formats order dates and converts order and payment status enums to readable labels.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, and persisting URL parameters, including session storage helpers and hash-parameter handling.",
  "frontend/src/utils/usStates.ts": "Exports a constant list of US states with value and label fields for dropdowns.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, colors, animations, plugins, and content paths.",
  "project_state.json": "Tracks project metadata, requirements, features, and pending admin panel and SEO tasks."
}