{
  "backend/main.mo": "Main Motoko canister implementing access-controlled user profiles and order submission with storage and admin role checks.",
  "backend/migration.mo": "Migration module defining legacy data structures and a passthrough upgrade function for actor state.",
  "backend/old.mo": "Legacy data model containing older order and signature types used prior to IDInformation refactor.",
  "feature_evidence.json": "Feature evidence report mapping features to frontend files, components, and associated test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summary list describing the purpose of various frontend files for documentation or build planning.",
  "frontend/DEPLOYMENT.md": "Comprehensive deployment guide explaining how to deploy the backend canister and host the frontend on cPanel.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining theme variables and light/dark mode color tokens.",
  "frontend/index.html": "Base HTML entry page mounting the React app and loading main.tsx.",
  "frontend/public/.htaccess": "Optional Apache config providing compression, caching, security headers, and MIME types for static hosting.",
  "frontend/public/DEPLOYMENT.md": "Guide for self-hosting the frontend on cPanel while relying on the backend deployed on the Internet Computer.",
  "frontend/src/App.tsx": "Main app component handling hash-based routing, authentication state, and layout with navigation.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Wrapper enforcing admin-only access with loading, error, and login states.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "Form for admins to update payment contact status and notes with validation and submit handling.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity authentication and error recovery.",
  "frontend/src/components/LoginRequiredScreen.tsx": "UI screen prompting unauthenticated users to log in before accessing protected actions.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component with drawing, clearing, and data export.",
  "frontend/src/hooks/useActor.ts": "Creates and manages an authenticated or anonymous backend actor, refreshing dependent queries on change.",
  "frontend/src/hooks/useAdmin.ts": "Hook checking admin permissions using the actor and II state with proper loading and error handling.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including login, logout, identity loading, and status flags.",
  "frontend/src/hooks/useOrders.ts": "Defines React Query hooks for submitting orders and fetching or updating order data through the backend actor.",
  "frontend/src/hooks/useProfile.ts": "Implements hooks to fetch and update the caller’s user profile, with identity-based query invalidation and refetching.",
  "frontend/src/index.css": "Configures global Tailwind styles, CSS variables for themes, and base layout/typography rules.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin view for loading order details, reviewing uploaded assets, and updating payment contact status with feedback.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin orders page that fetches all orders, applies search and filter logic, computes stats, and displays results in a table UI with admin-access gating.",
  "frontend/src/pages/HomePage.tsx": "Renders the marketing homepage with a hero section, feature cards, and navigation actions for ordering and pricing.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the logged‑in user’s orders, handles authentication gating, and shows detailed order views when selected.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays an order confirmation screen and auto-opens a modal with payment contact details and accepted methods.",
  "frontend/src/pages/OrderPage.tsx": "Provides a full order form with validation, ID info entry, photo/signature upload, and submission handling for authenticated users.",
  "frontend/src/pages/PricesPage.tsx": "Shows pricing details, feature highlights, and quantity examples with navigation to the order page.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and edit their profile details, save changes, and access admin tools if authorized.",
  "frontend/src/utils/assetPaths.ts": "Utility helpers that prepend the app’s base URL to asset and document paths for safe static hosting.",
  "frontend/src/utils/fileValidation.ts": "Client-side image file validator enforcing type and size limits plus helpers to convert files to byte arrays.",
  "frontend/src/utils/idGenerators.ts": "Randomized name and address generators using predefined lists for mock data.",
  "frontend/src/utils/orderFormatting.ts": "Formatting helpers for order timestamps and enum-based order and payment statuses.",
  "frontend/src/utils/urlParams.ts": "Utilities to read, persist, and clear URL parameters using query strings, hash routing, and sessionStorage.",
  "frontend/src/utils/usStates.ts": "Static list of US states with labels and abbreviations for form dropdowns.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending theme colors, fonts, animations, and enabling plugins.",
  "project_state.json": "Project metadata describing admin-access fixes, requirements, issues, and new feature requests tied to Internet Identity admin verification."
}