{
  "backend/main.mo": "Main Motoko canister with access control, blob storage, user profile management, and order creation logic with ID info and admin-invitation mappings.",
  "backend/old.mo": "Legacy module defining older Order and UserProfile types plus a minimal Actor state structure.",
  "feature_evidence.json": "Feature evidence report mapping features to affected frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend source files for reference in build planning.",
  "frontend/DEPLOYMENT.md": "Full deployment guide explaining how to deploy the backend to the Internet Computer and host the frontend on cPanel.",
  "frontend/index.css": "Tailwind base styles and custom OKLCH color variables with dark mode and global layout rules.",
  "frontend/index.html": "Root HTML file that loads the React app via main.tsx.",
  "frontend/public/.htaccess": "Optional Apache config providing compression, caching, security headers, and MIME types for static hosting.",
  "frontend/public/DEPLOYMENT.md": "Frontend hosting guide for deploying the React build to cPanel while the backend remains on the Internet Computer.",
  "frontend/src/App.tsx": "Main application component handling hash-based routing, authentication gates, admin invitation logic, and route rendering.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Guards admin-only routes by checking authentication and admin status, showing appropriate UI for loading, errors, or denied access.",
  "frontend/src/components/admin/AdminInvitationModal.tsx": "Modal allowing users to accept or decline admin invitations, with mutation handling and error display.",
  "frontend/src/components/admin/AdminOrderEditForm.tsx": "Editable admin form for updating order customer and shipping details with validation and change detection.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "React component providing a form to edit payment contact status and notes, with UI controls and submit handling.",
  "frontend/src/components/LoginButton.tsx": "Provides login/logout button using Internet Identity and manages related query invalidation.",
  "frontend/src/components/LoginRequiredScreen.tsx": "UI screen prompting users to log in with Internet Identity before accessing protected actions.",
  "frontend/src/components/PrincipalIdFooterBlock.tsx": "Empty placeholder component with no implementation.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component allowing drawing, clearing, and emitting signature data URLs.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity, refreshing dependent queries when identity changes.",
  "frontend/src/hooks/useAdmin.ts": "Hook to check if the current user is an admin, handling fallback authorization logic and query states.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Hook that auto‑assigns admin role to a designated bootstrap principal and refreshes related queries.",
  "frontend/src/hooks/useAdminInvitation.ts": "Hooks for checking, accepting, and declining admin invitations with retry logic and cache invalidation.",
  "frontend/src/hooks/useAdminRestore.ts": "Hook that reassigns admin role to the caller and invalidates admin-related queries.",
  "frontend/src/hooks/useEnsureUserRole.ts": "Hook ensuring authenticated users have refreshed role-related data by invalidating and refetching caches once per user.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity login, identity persistence, and AuthClient setup.",
  "frontend/src/hooks/useOrders.ts": "React Query hooks for submitting and fetching orders and updating order statuses via the actor API.",
  "frontend/src/hooks/useProfile.ts": "Hooks to fetch and save the caller's user profile and manage related query invalidation.",
  "frontend/src/hooks/useProfileGate.ts": "Determines whether an authenticated user must complete profile setup based on profile fetch state.",
  "frontend/src/index.css": "Tailwind base styles with theme variables, typography, transitions, and layout rules.",
  "frontend/src/main.tsx": "App entry point setting up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin view for a single order, enabling status updates, payment updates, and editing core order details.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin dashboard listing all orders with search, filtering, statistics, and deletion options.",
  "frontend/src/pages/HomePage.tsx": "Home page with hero banner, marketing content, and navigation buttons for ordering and pricing.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the user's orders, allows viewing order details, and handles authentication gating.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details and a modal with payment contact instructions.",
  "frontend/src/pages/OrderPage.tsx": "A full order form page handling authentication, form validation, ID info generation, file uploads, signatures, and submitting an order.",
  "frontend/src/pages/PricesPage.tsx": "Displays static pricing details, feature list, pricing tiers, and a button navigating to the order page.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and update their profile, with admin‑specific restore actions and success message handling.",
  "frontend/src/utils/assetPaths.ts": "Utility helpers for generating base‑path‑safe URLs for static assets and documents.",
  "frontend/src/utils/errorFormatting.ts": "Error formatting utilities that extract readable messages and redact sensitive information from errors.",
  "frontend/src/utils/fileValidation.ts": "Provides client-side image file validation and a helper to convert files to byte arrays.",
  "frontend/src/utils/idGenerators.ts": "Generates random names and US-style addresses using local data lists.",
  "frontend/src/utils/orderFormatting.ts": "Formats backend timestamps and enum values into human-readable order and payment status strings.",
  "frontend/src/utils/urlParams.ts": "Handles reading, persisting, and clearing URL and sessionStorage parameters, including hash-based routing support.",
  "frontend/src/utils/usStates.ts": "Exports a constant list of US states with value/label pairs.",
  "frontend/tailwind.config.js": "Configures TailwindCSS with custom colors, fonts, animations, and plugins.",
  "project_state.json": "Describes project state, requirements, and pending fixes for admin UI visibility and invitation handling."
}