{
  "backend/main.mo": "Main Motoko canister implementing orders, user profiles, admin login tracking, access control, banning, and blob storage mixins.",
  "backend/old.mo": "Older module defining simplified order, signature, and user profile types plus an actor state structure.",
  "feature_evidence.json": "Feature evidence report listing implemented features, related files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON-like mapping of frontend file paths to short feature and behavior summaries.",
  "frontend/DEPLOYMENT.md": "Detailed deployment guide describing backend IC requirements and frontend cPanel hosting steps.",
  "frontend/index.css": "Global Tailwind-based stylesheet defining color tokens, dark mode, and base element styling.",
  "frontend/index.html": "Base HTML document mounting the React app and loading the main TypeScript entry file.",
  "frontend/public/.htaccess": "Optional Apache config enabling compression, caching, MIME types, and security headers for static hosting.",
  "frontend/public/DEPLOYMENT.md": "Frontend-only deployment guide for hosting the React build on cPanel at FalconIds.com.",
  "frontend/src/App.tsx": "Main app component handling hash-based routing, authentication hooks, admin access checks, and showing admin invitation modals.",
  "frontend/src/components/admin/AdminAccessGate.tsx": "Gatekeeper component ensuring identity and admin panel session before rendering admin content.",
  "frontend/src/components/admin/AdminInvitationModal.tsx": "Modal for accepting or declining admin invitations, handling mutation states and errors.",
  "frontend/src/components/admin/AdminOrderEditForm.tsx": "Admin form for editing order and shipping details with validation and save handling.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "Component allowing admins to update a payment contact status and notes, with UI controls and submit handling.",
  "frontend/src/components/BannedUserGate.tsx": "Wrapper that blocks access for banned users, showing a suspension message if the current principal is banned.",
  "frontend/src/components/LoginButton.tsx": "Login/logout button managing Internet Identity auth, admin session clearing, and query invalidation.",
  "frontend/src/components/LoginRequiredScreen.tsx": "Displays a login-required message with reasons and a login button for unauthenticated users.",
  "frontend/src/components/PrincipalIdFooterBlock.tsx": "Empty placeholder component with no implemented content.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component allowing drawing, clearing, and emitting the signature as a data URL.",
  "frontend/src/hooks/useActor.ts": "Creates and caches an authenticated or anonymous backend actor and invalidates related queries when it changes.",
  "frontend/src/hooks/useAdmin.ts": "Deprecated hook that checks whether the current user is an admin by calling the backend and managing loading and error states.",
  "frontend/src/hooks/useAdminBootstrap.ts": "Automatically assigns the admin role to a designated principal once per session and invalidates admin-related queries.",
  "frontend/src/hooks/useAdminInvitation.ts": "Hooks for checking, accepting, or declining admin invitations with query invalidation and retry logic.",
  "frontend/src/hooks/useAdminLogin.ts": "Handles admin panel login via backend credentials and activates local admin panel session state.",
  "frontend/src/hooks/useAdminPanelSession.ts": "Manages persistent admin panel session state per principal, including load, set, and clear operations.",
  "frontend/src/hooks/useAdminRestore.ts": "Mutation hook that restores admin privileges for the current caller and refreshes related queries.",
  "frontend/src/hooks/useEnsureUserRole.ts": "Ensures authenticated users have the user role by invalidating and refreshing role-related caches once per principal.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity authentication context, handling login, identity state, and auth client creation.",
  "frontend/src/hooks/useOrders.ts": "React Query hooks for creating, fetching, and updating orders using the backend actor, with cache invalidation on changes.",
  "frontend/src/hooks/useProfile.ts": "Hooks to fetch and save the authenticated user's profile, including cache invalidation for profile and admin status.",
  "frontend/src/hooks/useProfileGate.ts": "Determines whether an authenticated user must complete profile setup by checking profile state and auth status.",
  "frontend/src/hooks/useUserBans.ts": "Provides hooks to query banned users, check if a principal is banned, and ban or unban users with cache updates.",
  "frontend/src/index.css": "Tailwind CSS setup defining theming variables, dark mode styles, typography, transitions, and layout rules.",
  "frontend/src/main.tsx": "Application entry point that initializes React, sets up QueryClient, InternetIdentityProvider, and global styles.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Handles admin login flow with authentication checks, session handling, and credential validation.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin page for viewing and editing a single order, handling status changes, payment updates, and customer detail edits.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin list view for all orders with search, filtering, statistics, and delete confirmation handling.",
  "frontend/src/pages/admin/AdminUsersPage.tsx": "Admin interface for listing users from orders, managing bans, and unbanning users with validation and confirmations.",
  "frontend/src/pages/HomePage.tsx": "Home page component displaying a hero section, navigation buttons, and informational cards about the service.",
  "frontend/src/pages/MyOrdersPage.tsx": "Page for authenticated users to view and inspect their orders, with loading states, authentication gating, and order details.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Displays an order confirmation screen and auto-opens a modal with payment contact details and accepted methods.",
  "frontend/src/pages/OrderPage.tsx": "Implements a full order form with validation, ID info fields, photo and signature upload, and order submission logic.",
  "frontend/src/pages/PricesPage.tsx": "Shows pricing details for IDs, feature breakdowns, and links users to the order page.",
  "frontend/src/pages/ProfilePage.tsx": "Allows authenticated users to view and edit their profile information, copy their principal ID, and restore admin access if authorized.",
  "frontend/src/utils/adminPanelSession.ts": "LocalStorage helpers for storing and clearing admin-session markers by principal ID.",
  "frontend/src/utils/assetPaths.ts": "Utilities for generating base-path-safe URLs for static assets and documents.",
  "frontend/src/utils/errorFormatting.ts": "Formats and redacts error messages and extracts backend-specific error details.",
  "frontend/src/utils/fileValidation.ts": "Client-side validators for image file type and size plus utilities to convert files to byte arrays.",
  "frontend/src/utils/idGenerators.ts": "Random generators for fake names and addresses using local predefined lists.",
  "frontend/src/utils/orderFormatting.ts": "Formatting helpers for order dates and readable status labels.",
  "frontend/src/utils/urlParams.ts": "Provides helpers to read URL parameters, persist them in sessionStorage, and clear parameters from the hash for routing and state retention.",
  "frontend/src/utils/usStates.ts": "Exports a constant list of US states with value/label pairs for UI dropdowns.",
  "frontend/tailwind.config.js": "TailwindCSS configuration defining theme extensions, colors, animations, and enabled plugins for the frontend.",
  "project_state.json": "Describes the project’s state and requirements focused on removing admin-only restrictions and persisting admin login sessions."
}