{
  "backend/main.mo": "Motoko canister implementing order management, user profiles, authorization checks, and admin-only mutations with storage and blob handling mixins.",
  "backend/old.mo": "Defines legacy types for orders, user profiles, and actor state structure without active logic.",
  "feature_evidence.json": "Feature evidence listing UI files and components tied to removal of legal/novelty notices across multiple frontend pages.",
  "frontend-file-summaries.txt": "Text file providing short descriptions for various frontend components, hooks, pages, and utilities.",
  "frontend/DEPLOYMENT.md": "Frontend deployment guide describing architecture, IC backend constraints, and steps for hosting the React app on cPanel.",
  "frontend/index.css": "Global Tailwind CSS base with OKLCH theme variables, dark mode values, and styling resets.",
  "frontend/index.html": "HTML entrypoint loading the React app via main.tsx with root container.",
  "frontend/public/.htaccess": "Optional Apache config enabling compression, caching, MIME types, and security headers for static hosting.",
  "frontend/public/DEPLOYMENT.md": "Frontend self‑hosting guide for deploying the React build to cPanel and connecting it to the IC backend.",
  "frontend/src/App.tsx": "Implements hash-based routing, admin access checks, and renders pages with navigation and authentication handling.",
  "frontend/src/components/admin/PaymentContactControls.tsx": "Admin form to update payment/contact status and notes with validation and submission handling.",
  "frontend/src/components/LoginButton.tsx": "Provides a login/logout button using Internet Identity with loading and error handling.",
  "frontend/src/components/LoginRequiredScreen.tsx": "Displays a card explaining that login is required and offers a login button.",
  "frontend/src/components/SignaturePad.tsx": "Canvas-based signature input component with drawing, clearing, and change callbacks.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, invalidating dependent queries when changed.",
  "frontend/src/hooks/useAdmin.ts": "Checks whether the authenticated user is an admin using the backend actor.",
  "frontend/src/hooks/useInternetIdentity.ts": "Context and hooks for managing Internet Identity authentication, login state, and stored identities.",
  "frontend/src/hooks/useOrders.ts": "Provides React Query hooks for submitting orders, retrieving orders, and updating order or payment statuses using an actor API.",
  "frontend/src/hooks/useProfile.ts": "Defines hooks for fetching and saving the current user's profile, with query invalidation and admin-status refresh logic.",
  "frontend/src/index.css": "Configures Tailwind base styles, CSS variables for light/dark themes, typography rules, transitions, and layout overflow behavior.",
  "frontend/src/main.tsx": "Initializes the React app, wrapping it with React Query and Internet Identity providers.",
  "frontend/src/pages/admin/AdminOrderDetailsPage.tsx": "Admin view for a single order with status badges, photo/signature previews, and payment contact controls.",
  "frontend/src/pages/admin/AdminOrdersPage.tsx": "Admin order list with search, filtering, stats, and navigation to individual order details.",
  "frontend/src/pages/HomePage.tsx": "Renders the homepage with a hero banner, navigation buttons, and feature sections describing the ID card service.",
  "frontend/src/pages/MyOrdersPage.tsx": "Displays the user's orders, handles authentication checks, and shows detailed views for selected orders.",
  "frontend/src/pages/OrderConfirmationPage.tsx": "Shows order confirmation details and an automatic payment info modal after an order is placed.",
  "frontend/src/pages/OrderPage.tsx": "Renders an authenticated order form with validation, photo/signature upload, and submission logic.",
  "frontend/src/pages/PricesPage.tsx": "Displays pricing details, feature list, and example tiers with navigation to the order page.",
  "frontend/src/pages/ProfilePage.tsx": "Shows and updates the user's profile information, handling authentication, loading, and admin access checks.",
  "frontend/src/utils/assetPaths.ts": "Provides helpers to generate base-path-safe URLs for assets and documents.",
  "frontend/src/utils/fileValidation.ts": "Includes image file validation and a utility to convert uploaded files to byte arrays.",
  "frontend/src/utils/idGenerators.ts": "Provides random full-name and address generators using local arrays and helper functions.",
  "frontend/src/utils/orderFormatting.ts": "Formats backend time and enum values into human‑readable order and payment status strings.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, persisting, and clearing URL and sessionStorage parameters, including hash‑based routing support.",
  "frontend/src/utils/usStates.ts": "Exports a static list of US states for UI dropdowns.",
  "frontend/tailwind.config.js": "Tailwind configuration extending typography, colors, animations, and container settings with custom plugins.",
  "project_state.json": "JSON snapshot describing project metadata, existing features, and pending feature requests."
}