{
  "kind": "build_request",
  "title": "Fix admin panel visibility and access using Internet Identity principal (no flashing for non-admins)",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Implement a backend query method `isCallerAdmin : async Bool` that the frontend can call to verify whether the currently authenticated Internet Identity principal is an admin.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-1",
          "msg-user-2"
        ],
        "quotes": [
          "So i see the admin panel button loads then disappears so i cant even click in it and i don't want users to see that only if there admin (traviscastonguay@gmail.com)",
          "1. yes your II principal 2. yes exactly 3. yes"
        ]
      },
      "acceptanceCriteria": [
        "The backend exposes a callable method named `isCallerAdmin`.",
        "When called by an authenticated principal, `isCallerAdmin` returns `true` only for principals configured as admin; otherwise `false`.",
        "The method does not trap for non-admin callers (returns `false` instead), so the frontend can safely use it for gating UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change admin authorization to be based on an Internet Identity principal stored and verified in the backend (not based on email), and ensure the chosen admin principal persists across canister upgrades.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-user-2"
        ],
        "quotes": [
          "1. yes your II principal 2. yes exactly 3. yes"
        ]
      },
      "acceptanceCriteria": [
        "Admin status is determined by the caller principal, not by any email value in `UserProfile`.",
        "There is a persistent backend source of truth for admin principal(s) that survives canister upgrades.",
        "Existing admin-only backend methods (e.g., `getAllOrders`, `updateOrderStatus`, `updatePaymentContactStatus`) continue to be protected by admin checks and do not become accessible to non-admins."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update the frontend navigation so the “Admin Panel” button/link is never shown to non-admin users and does not flash while admin status is still loading; it should only render once the admin check has completed and confirmed the user is an admin.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-1"
        ],
        "quotes": [
          "the admin panel button loads then disappears so i cant even click in it and i don't want users to see that only if there admin"
        ]
      },
      "acceptanceCriteria": [
        "When logged out, no Admin Panel entry is visible.",
        "When logged in as a non-admin, no Admin Panel entry is visible at any time (no flash during loading).",
        "When logged in as an admin, the Admin Panel entry appears and remains clickable.",
        "The mobile and desktop navigation follow the same admin-visibility rules."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Ensure the `/admin` route remains protected even if a user manually navigates to it (e.g., by editing the hash): unauthenticated users must see an admin login prompt, and authenticated non-admin users must see an access denied screen.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-user-2"
        ],
        "quotes": [
          "2. yes exactly"
        ]
      },
      "acceptanceCriteria": [
        "Visiting `#/admin` while logged out shows an “Admin Access Required” login prompt.",
        "Visiting `#/admin` while logged in as a non-admin shows an “Access Denied” screen.",
        "Visiting `#/admin` while logged in as an admin shows the admin dashboard content."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend/immutablePaths.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing basic SEO across all pages.",
    "Adding additional admin features like user management beyond principal-based gating and visibility.",
    "Third-party authentication providers (only Internet Identity)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}