{
  "kind": "build_request",
  "title": "Remove admin-only restrictions for admin panel and persist admin-panel login",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix backend adminLogin so it no longer attempts to assign the #admin role (which currently traps with \"Unauthorized: Only admins can assign user roles\"). Instead, adminLogin must only validate the provided username/password and, on success, record the caller in the existing adminLoginStatus map and return true; on failure, return false.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "this is the error Unauthorized: Only admins can assign user roles and yes its the right login",
          "remove admin‑only restrictions entirely yes"
        ]
      },
      "acceptanceCriteria": [
        "Calling adminLogin with the correct credentials returns true and does not trap with any Unauthorized error.",
        "Calling adminLogin with incorrect credentials returns false.",
        "The backend still compiles and existing non-admin flows (profile, ordering) are unaffected."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove admin-only role restrictions for admin-panel operations in the backend so that any authenticated, non-banned user (i.e., #user) can perform the operations needed by the admin dashboard (view all orders, edit/update/delete orders, update payment contact status, add/update tracking number, view banned users, and ban/unban users). Preserve banned-user protections and preserve user-role checks where applicable.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove admin‑only restrictions entirely yes",
          "Anyone with login should be able to login to admin panel and when you do the panel page should come up"
        ]
      },
      "acceptanceCriteria": [
        "A non-admin principal with the #user role can successfully call getAllOrders, updateOrderStatus, updatePaymentContactStatus, updateOrder, deleteOrder, addOrUpdateTrackingNumber, getBannedUsers, isBannedUser, banUser, and unbanUser without receiving an \"Only admins\" error.",
        "If the caller is banned, backend methods that currently block banned users continue to trap with \"Unauthorized: User is banned\" (or equivalent existing banned-user behavior).",
        "Normal users can still only view their own orders via getOrder/getMyOrders unless the requirement explicitly changes that behavior for admin-panel use."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update frontend admin access gating so admin dashboard pages no longer depend on isCallerAdmin/isAdmin role checks. Admin pages must be accessible after a successful admin credential login (username/password), while still requiring Internet Identity authentication (as currently enforced on the Admin Login page).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "remove admin‑only restrictions entirely yes",
          "Anyone with login should be able to login to admin panel and when you do the panel page should come up"
        ]
      },
      "acceptanceCriteria": [
        "After logging in with Internet Identity and then submitting valid admin credentials, navigating to #/admin (and other admin routes such as #/admin/users) displays the admin pages without showing an \"Access Denied\" admin-only gate.",
        "If the user is not authenticated with Internet Identity, the admin login flow still shows the existing LoginRequiredScreen behavior."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Persist admin-panel login session on the frontend so that after a successful admin credential login, the user remains \"admin-panel logged in\" across page refreshes and revisits, and does not need to re-enter admin credentials until they explicitly log out (or their Internet Identity session is cleared).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "so if a account has admin login it will save there admin panel login so theyt dont have to login again"
        ]
      },
      "acceptanceCriteria": [
        "After a successful admin credential login, refreshing the page preserves admin-panel access and does not prompt for admin credentials again.",
        "Logging out (Internet Identity logout via the existing LoginButton) clears the persisted admin-panel login state so the user must re-enter admin credentials next time.",
        "The persisted state does not store the raw admin password in localStorage/sessionStorage (store only a boolean/session marker)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single Motoko actor with all logic in backend/main.mo.",
    "Do not edit files under frontend/src/components/ui or any paths listed in frontend immutablePaths (compose them instead).",
    "Use English for all user-facing UI text."
  ],
  "nonGoals": [
    "Implementing third-party authentication or any auth provider other than Internet Identity.",
    "Adding new database infrastructure or external storage services.",
    "Changing the visual design of the admin pages beyond what is necessary to remove/replace admin-only gating."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}