{
  "kind": "build_request",
  "title": "Rebuild and fix Admin Panel visibility and routing (button + page)",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the admin-status check so the Admin Panel button can render and the admin route can be accessed without errors by implementing the backend method that the frontend calls (`isCallerAdmin`).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the admin panel is not working the page wont come up neither will the button rebuild it and fix it"
        ]
      },
      "acceptanceCriteria": [
        "Backend canister exposes a query method named `isCallerAdmin : () -> async Bool` (or equivalent in Motoko) that returns whether the caller is an admin based on current access control state.",
        "`actor.isCallerAdmin()` no longer throws a 'method not found' / candid mismatch error when called from the frontend.",
        "Calling `isCallerAdmin()` as an anonymous (not logged in) user returns `false` (or traps with a clear authorization message; if it traps, frontend must handle it—see REQ-2)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Rebuild the Admin Panel entry flow so the Admin Panel button and page are reliably reachable: show an admin navigation entry for authenticated users even while admin status is loading, and ensure the admin page provides a clear loading / retry / access-denied state instead of appearing \"not popping up\".",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "the admin panel is not working the page wont come up neither will the button rebuild it and fix it"
        ]
      },
      "acceptanceCriteria": [
        "After logging in with Internet Identity, the header navigation includes an Admin entry in both desktop and mobile menus: while admin status is still being checked, the Admin entry renders in a loading/disabled state rather than being hidden.",
        "If admin status check fails (e.g., backend error), the user can still navigate to `#/admin`, and the admin page shows an actionable error with a retry control that re-runs the admin check.",
        "If the user is authenticated but not an admin, navigating to `#/admin` shows a clear “no permission” message (existing behavior is acceptable) and does not blank-screen.",
        "If the user is an admin, the Admin Panel button navigates to `#/admin` and the Admin Orders page renders successfully."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/hooks/useInternetIdentity.ts or frontend/src/hooks/useActor.ts (immutable paths).",
    "Backend must remain a single Motoko actor in backend/main.mo; add migration.mo only if required by state changes (not expected for adding a new query method)."
  ],
  "nonGoals": [
    "Implementing new admin features beyond making the existing admin orders pages accessible (e.g., full user management UI) is out of scope for this fix.",
    "Adding or expanding SEO changes is out of scope for this fix request."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}