{
  "kind": "build_request",
  "title": "Fix profile save/admin access by reliably ensuring '#user' role after Internet Identity login",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Ensure the frontend reliably calls the backend method ensureUserRole() immediately after a successful Internet Identity authentication and whenever an authenticated actor becomes available, so newly authenticated principals always receive the '#user' role before profile save/admin checks run.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Yes please"
        ]
      },
      "acceptanceCriteria": [
        "After a successful Internet Identity login, ensureUserRole() is invoked once for that principal without requiring a manual page refresh.",
        "If the actor is recreated (e.g., identity changes), ensureUserRole() is invoked again for the new principal.",
        "The implementation does not require editing any files under frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts (immutable paths)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Improve the Profile page save failure feedback by displaying the underlying backend error message (when available) in addition to the generic 'Failed to save profile' message, to make role/authorization failures diagnosable during testing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-2",
          "msg-6"
        ],
        "quotes": [
          "I tried to change it and this still pops up",
          "Yes please"
        ]
      },
      "acceptanceCriteria": [
        "When saveCallerUserProfile fails, the UI shows a human-readable error string derived from the thrown error (e.g., includes 'Unauthorized' or trap message when present).",
        "The existing generic destructive alert remains, but includes additional details when available.",
        "No sensitive secrets (e.g., admin token query param values) are ever rendered in the UI."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add a minimal regression check (in code, not an external test framework requirement) to prevent silent failures of ensureUserRole(): log a single, clearly labeled debug message when ensureUserRole() fails after authentication, including the principal string and the error message (if any).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-6"
        ],
        "quotes": [
          "Yes please"
        ]
      },
      "acceptanceCriteria": [
        "On an ensureUserRole() failure, the browser console includes one labeled debug log entry containing the principal string and the error message (if available).",
        "EnsureUserRole failure logging does not spam repeatedly for the same principal in a stable session."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister (all logic in backend/main.mo).",
    "Do not edit frontend immutable paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, and anything under frontend/src/components/ui.",
    "Do not introduce third-party auth providers; only Internet Identity is supported."
  ],
  "nonGoals": [
    "Changing the backend admin auto-promotion rule (the special email check) or adding new admin management UI.",
    "Adding new authentication methods or external database/storage systems.",
    "Implementing real-time updates (WebSockets/push notifications)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}