{
  "kind": "build_request",
  "title": "Temporarily display logged-in user principal ID on Home page footer",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "On the main/home page only, when the user is authenticated via Internet Identity, display the current user's Principal ID at the very bottom of the page (footer area).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-12",
          "recent-13"
        ],
        "quotes": [
          "main/home,  automatically remove the display, current users ID",
          "You never made the principle ID thing like we talked about do that now"
        ]
      },
      "acceptanceCriteria": [
        "When not logged in, no Principal ID is shown anywhere on the Home page.",
        "When logged in, the Home page shows a clearly labeled value (e.g., \"Principal ID:\") containing identity.getPrincipal().toText().",
        "The Principal ID display is visually placed at the bottom of the Home page (in or directly above the global footer) and does not overlap other content on mobile or desktop.",
        "The Principal ID display appears only on the Home route and does not appear on Order, Prices, Profile, My Orders, or Admin pages."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a one-click copy-to-clipboard control next to the displayed Principal ID on the Home page, with user-facing feedback text in English indicating success or failure.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-14"
        ],
        "quotes": [
          "build it"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the copy control copies the exact Principal ID text to the clipboard.",
        "After copying, the UI shows an English success message (e.g., \"Copied\").",
        "If clipboard copy fails, the UI shows an English error message (e.g., \"Copy failed\")."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement the Principal ID display as an easily removable, clearly isolated UI block (e.g., a small component or guarded block) so it can be deleted in a follow-up update without impacting other footer features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-12"
        ],
        "quotes": [
          "automatically remove the display"
        ]
      },
      "acceptanceCriteria": [
        "The Principal ID display code is confined to a single, clearly named component or guarded block.",
        "Removing that component/block fully removes the Principal ID display without breaking the global footer layout or navigation."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/components/ui (compose existing UI components instead).",
    "Do not edit any frontend paths listed as immutable in SYSTEM_CONTEXT.",
    "No backend changes are required for displaying the Principal ID; derive it from the authenticated identity already available in the frontend."
  ],
  "nonGoals": [
    "Do not add any new admin-panel functionality or other admin updates in this change set.",
    "Do not introduce new authentication providers; continue using Internet Identity only.",
    "Do not persist the Principal ID to the backend or store it in canister state."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}