{
  "kind": "build_request",
  "title": "Remove legal and novelty notices from the customer ordering experience",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove the “Important Legal Notice” section and any other legal/novelty disclaimer messaging from the marketing homepage so customers are not shown legal/novelty notices while browsing.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Remove all Legal Notice and novelty notice the people ordering I tell them my self"
        ]
      },
      "acceptanceCriteria": [
        "Home page no longer renders the section titled “Important Legal Notice”.",
        "Home page no longer includes the novelty/entertainment-only disclaimer sentences (e.g., “novelty… for entertainment… only”, “not intended to be used as real identification”, “Using novelty IDs… is illegal”).",
        "Page layout remains visually consistent and free of empty gaps where the removed section previously appeared."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove legal/novelty notice UI from the order page, including the warning alert and the lawful-use attestation requirement, so users can submit an order without acknowledging a novelty/legal disclaimer.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Remove all Legal Notice and novelty notice the people ordering I tell them my self"
        ]
      },
      "acceptanceCriteria": [
        "Order page no longer shows the warning alert that starts with “Novelty Use Only:”.",
        "Any attestation checkbox and related copy (lawful-use agreement) is removed from the order form UI.",
        "Client-side validation no longer blocks submission due to attestation (i.e., no “You must agree to the lawful use attestation to proceed” error).",
        "Submitting an order still requires the existing required fields (contact/shipping fields, ID info fields, photo, signature) and successfully calls the existing submit order mutation."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove legal/novelty notice wording from other customer-facing ordering-flow pages where it appears (e.g., prices page and order confirmation content), ensuring customers are not shown legal/novelty disclaimer notices anywhere in the flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "recent-messages-user-1"
        ],
        "quotes": [
          "Remove all Legal Notice and novelty notice the people ordering I tell them my self"
        ]
      },
      "acceptanceCriteria": [
        "Prices and confirmation pages do not include legal/novelty disclaimer notice text (e.g., “novelty… for entertainment… only”, “not real government IDs”, “illegal”, “lawful use only”).",
        "All pages still render without runtime errors and keep their core content (pricing, payment contact info, order ID, next steps)."
      ]
    }
  ],
  "constraints": [
    "Frontend must not modify files under frontend/src/components/ui (shadcn components are read-only).",
    "Frontend must not edit immutable hook/bootstrap files listed in SYSTEM_CONTEXT. Compose them instead if needed.",
    "Do not change backend data model or canister interfaces (no Motoko schema or API changes required for removing UI notices)."
  ],
  "nonGoals": [
    "Do not change pricing amounts, payment contact information, or accepted payment methods.",
    "Do not change order submission fields or backend order persistence beyond removing the attestation/disclaimer gating in the UI.",
    "Do not change admin order management features."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}