{
  "kind": "build_request",
  "title": "Auto-assign 'user' role on first authenticated login to fix profile-save deadlock",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Fix the circular authorization dependency that blocks new authenticated users from saving their profile by ensuring any authenticated caller is automatically granted the '#user' role on first login (or first authenticated interaction).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix the user role issue"
        ]
      },
      "acceptanceCriteria": [
        "A newly authenticated Internet Identity principal can save a profile successfully without having any pre-existing roles.",
        "The backend no longer traps with \"Unauthorized: Only users can save profiles\" for a newly authenticated user who has never saved a profile before.",
        "The backend does not grant the '#user' role to the anonymous principal.",
        "Existing admin checks/role behavior remain intact, including the email-based auto-promotion logic currently present in saveCallerUserProfile for \"traviscastonguay@gmail.com\"."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Add a dedicated backend method that the frontend can call after Internet Identity login to ensure the caller has the '#user' role (idempotent; safe to call multiple times), and use it as the primary mechanism to bootstrap the user role.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix the user role issue"
        ]
      },
      "acceptanceCriteria": [
        "A new public shared backend method exists to \"ensure\"/\"register\" the caller as a user and returns successfully when the caller is already a user.",
        "Calling the method as an authenticated principal results in the caller having '#user' permission afterward.",
        "Calling the method as anonymous traps with a clear unauthorized message (English)."
      ]
    },
    {
      "id": "REQ-3",
      "text": "On the frontend, automatically invoke the new backend \"ensure user role\" method immediately after a successful Internet Identity login (and whenever the authenticated actor becomes available), then invalidate/refetch profile and admin-related React Query caches as needed so UI state updates without requiring a manual page refresh.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Fix the user role issue"
        ]
      },
      "acceptanceCriteria": [
        "After logging in with a brand-new Internet Identity principal, navigating to the Profile page and clicking \"Save Changes\" succeeds (no \"Failed to save profile\" error).",
        "No manual 'save profile first' or hard refresh is required to make profile-related actions work after first login.",
        "The frontend does not modify any files under the immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)."
      ]
    }
  ],
  "constraints": [
    "Backend must remain a single-actor Motoko canister with all logic in backend/main.mo.",
    "Generate backend/migration.mo changes only if existing stable state must be upgraded (follow conditional migration policy).",
    "Do not edit frontend files in SYSTEM_CONTEXT.frontend.immutablePaths; compose around them.",
    "Use English for any user-facing text (errors, messages)."
  ],
  "nonGoals": [
    "Changing the admin authorization model (e.g., switching from email-based admin promotion to principal allowlisting) is out of scope for this fix.",
    "Redesigning the UI/visual theme is out of scope.",
    "Adding third-party authentication providers beyond Internet Identity is out of scope."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}