{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove admin-role gating and persist admin-panel credential session",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Remove isCallerAdmin/isAdmin role-based gating from admin routes and instead gate admin pages by successful admin-credential login (while still requiring Internet Identity authentication).",
      "acceptanceCriteria": [
        "After logging in with Internet Identity and then submitting valid admin credentials, navigating to #/admin (and other admin routes such as #/admin/users) displays the admin pages without showing an \"Access Denied\" admin-only gate.",
        "If the user is not authenticated with Internet Identity, the admin login flow still shows the existing LoginRequiredScreen behavior."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Remove dependency on useCheckAdminAccess/isCallerAdmin-related state for routing/gating; ensure admin routes rely on the admin-panel session gate (and not role checks). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminAccessGate.tsx",
          "operation": "modify",
          "description": "Replace role-based admin checks (useCheckAdminAccess / Access Denied UI) with an admin-panel session gate: require Internet Identity authentication, then require a persisted admin-panel login marker; if not present, redirect/navigate to the Admin Login route and/or show a login-required message for the admin panel (without using isCallerAdmin). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminOrdersPage.tsx",
          "operation": "modify",
          "description": "Remove useCheckAdminAccess/isAdmin-dependent query enabling and load admin dashboard data based on authenticated actor + admin-panel session gate only (AdminAccessGate). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminUsersPage.tsx",
          "operation": "modify",
          "description": "Remove useCheckAdminAccess/isAdmin-dependent query enabling and load user-management data based on authenticated actor + admin-panel session gate only (AdminAccessGate). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminOrderDetailsPage.tsx",
          "operation": "modify",
          "description": "Ensure order-details admin page relies on the admin-panel session gate (AdminAccessGate) and does not depend on any isCallerAdmin/isAdmin checks to render. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useOrders.ts",
          "operation": "modify",
          "description": "Update admin-dashboard order query hooks to no longer require an isAdmin boolean for enabling; instead, allow enabling based on authenticated actor and admin-panel session state (provided by a new hook), without calling isCallerAdmin. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useUserBans.ts",
          "operation": "modify",
          "description": "Ensure banned-users related queries/mutations used by the admin panel are enabled/used based on authenticated actor + admin-panel session state (not isCallerAdmin/isAdmin). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdmin.ts",
          "operation": "modify",
          "description": "Deprecate or neutralize role-check-based admin access hook usage for admin-page gating so the admin panel no longer depends on isCallerAdmin/isAdmin checks; keep any remaining usage from other parts of the app intact. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Persist admin-panel credential-login state on the frontend across refreshes; clear the persisted marker on Internet Identity logout; do not store raw passwords.",
      "acceptanceCriteria": [
        "After a successful admin credential login, refreshing the page preserves admin-panel access and does not prompt for admin credentials again.",
        "Logging out (Internet Identity logout via the existing LoginButton) clears the persisted admin-panel login state so the user must re-enter admin credentials next time.",
        "The persisted state does not store the raw admin password in localStorage/sessionStorage (store only a boolean/session marker)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/adminPanelSession.ts",
          "operation": "create",
          "description": "Add a small utility to set/get/clear a persisted admin-panel session marker in localStorage keyed to the current principal (store only a boolean/session marker; never store the password). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminPanelSession.ts",
          "operation": "create",
          "description": "Create a hook that exposes admin-panel session state (e.g., isAdminPanelLoggedIn, setLoggedIn, clearLoggedIn) derived from the current Internet Identity principal and persisted storage; update reactively when identity changes. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useAdminLogin.ts",
          "operation": "modify",
          "description": "On successful backend adminLogin(username,password), set the persisted admin-panel session marker (no password storage) and navigate to /admin; remove role-check refresh flows that rely on invalidating/refetching isAdmin. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/admin/AdminLoginPage.tsx",
          "operation": "modify",
          "description": "After successful admin credential login, rely on the persisted admin-panel session marker for subsequent access; optionally adjust UX to reflect already-logged-in admin-panel state when revisiting this page. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "modify",
          "description": "When performing Internet Identity logout, clear the persisted admin-panel session marker (and any related cached session state) so admin credentials are required next time. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminAccessGate.tsx",
          "operation": "modify",
          "description": "Integrate the new persisted admin-panel session hook so admin routes remain accessible across refreshes after a successful credential login; if identity is cleared, require admin credentials again (no role checks). Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}