{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Reliable post-auth #user role assignment and improved profile save diagnostics",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Trigger ensureUserRole() reliably right after Internet Identity authentication and whenever an authenticated actor becomes available, without modifying immutable auth/actor hooks.",
      "acceptanceCriteria": [
        "After a successful Internet Identity login, ensureUserRole() is invoked once for that principal without requiring a manual page refresh.",
        "If the actor is recreated (e.g., identity changes), ensureUserRole() is invoked again for the new principal.",
        "The implementation does not require editing any files under frontend/src/hooks/useInternetIdentity.ts(x) or frontend/src/hooks/useActor.ts (immutable paths)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useEnsureUserRole.ts",
          "operation": "modify",
          "description": "Harden the post-auth role-ensuring flow: ensure actor+identity readiness detection triggers a single ensureUserRole() call per principal immediately after authentication and again when the principal changes (actor recreation). Keep the logic independent of immutable hooks. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/LoginButton.tsx",
          "operation": "modify",
          "description": "After a successful login action, proactively prompt role initialization by invalidating/refetching relevant react-query caches (e.g., actor-dependent queries), so ensureUserRole() runs without a manual refresh. Do not render or log any secret URL params. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Show backend-derived save error details on the Profile page while retaining the existing generic destructive alert and redacting sensitive values.",
      "acceptanceCriteria": [
        "When saveCallerUserProfile fails, the UI shows a human-readable error string derived from the thrown error (e.g., includes 'Unauthorized' or trap message when present).",
        "The existing generic destructive alert remains, but includes additional details when available.",
        "No sensitive secrets (e.g., admin token query param values) are ever rendered in the UI."
      ],
      "file_operations": [
        {
          "path": "frontend/src/utils/errorFormatting.ts",
          "operation": "create",
          "description": "Add a small helper to extract a human-readable message from unknown thrown errors and apply redaction rules (e.g., remove/obfuscate caffeineAdminToken-like values and other obvious secret patterns) before display. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Enhance the destructive save error Alert to append sanitized, human-readable details from the mutation error (using the new error formatting helper) while keeping the existing generic 'Failed to save profile' copy. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Add a minimal, non-spamming debug log when ensureUserRole() fails after authentication, including principal and error message.",
      "acceptanceCriteria": [
        "On an ensureUserRole() failure, the browser console includes one labeled debug log entry containing the principal string and the error message (if available).",
        "EnsureUserRole failure logging does not spam repeatedly for the same principal in a stable session."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useEnsureUserRole.ts",
          "operation": "modify",
          "description": "Implement once-per-principal failure logging for ensureUserRole(): on failure, emit a single clearly labeled console.debug containing principal string and extracted error message, and prevent repeated logs for the same principal until the principal changes or logout occurs. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}