{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Frontend: Ensure '#user' role bootstrap after Internet Identity login",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Automatically call backend ensureUserRole after II login/actor readiness and refresh React Query caches so profile/admin UI works immediately.",
      "acceptanceCriteria": [
        "After logging in with a brand-new Internet Identity principal, navigating to the Profile page and clicking \"Save Changes\" succeeds (no \"Failed to save profile\" error).",
        "No manual 'save profile first' or hard refresh is required to make profile-related actions work after first login.",
        "The frontend does not modify any files under the immutable paths listed in SYSTEM_CONTEXT (e.g., frontend/src/hooks/useInternetIdentity.ts(x), frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useEnsureUserRole.ts",
          "operation": "create",
          "description": "Create a dedicated hook that uses the authenticated actor to call backendInterface.ensureUserRole() once per authenticated principal (idempotent), and on success invalidates/refetches React Query caches for profile/admin state (e.g., ['currentUserProfile'], ['isAdmin', principal]). Use the authorization system’s role bootstrap capability by invoking ensureUserRole. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the new useEnsureUserRole hook into the top-level app so it runs immediately after a successful Internet Identity login (and whenever the authenticated actor becomes available), without changing immutable auth/actor/provider files. Ensure it triggers cache invalidation/refetch so Profile/Admin UI updates without refresh. Use the authorization system’s role bootstrap capability by invoking ensureUserRole. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/hooks/useProfile.ts",
          "operation": "modify",
          "description": "Harden profile-saving flow by ensuring ensureUserRole() is invoked before saveCallerUserProfile when authenticated (defensive against race conditions), and keep/increase cache invalidation/refetch for ['currentUserProfile'] and admin-related keys after successful save. Use the authorization system’s role bootstrap capability by invoking ensureUserRole. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}