{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Fix admin nav visibility and ensure admin invitation modal reliably auto-opens after login",
  "requirements": [
    {
      "id": "REQ-2",
      "summary": "Show the “Admin Panel” button in the header only for authenticated admins and navigate directly to #/admin when clicked.",
      "acceptanceCriteria": [
        "When logged out, no admin button/link is shown.",
        "When logged in as a non-admin, no admin button/link is shown.",
        "When logged in as an admin, “Admin Panel” is visible in the desktop header navigation and in the mobile menu, and clicking it navigates to `#/admin`."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdmin.ts",
          "operation": "modify",
          "description": "Harden admin detection by using the backend role-check capability exposed by the authorization system: attempt `actor.isCallerAdmin()` and fall back to `actor.isAdmin()` if needed, while ensuring non-admin callers resolve to `false` without breaking rendering. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the header’s “Admin Panel” button is rendered based on the updated `useCheckAdminAccess()` result and navigates to `#/admin` in both desktop navigation and the mobile menu (no change to overall layout beyond visibility). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Automatically open the admin invitation accept/decline modal immediately after login when there is a pending admin invitation, with automatic re-checks to avoid timing suppression.",
      "acceptanceCriteria": [
        "When a principal with a pending invitation logs in, the “Admin Access Invitation” modal opens automatically without requiring any user click.",
        "If the invitation status initially fails due to role/authorization timing, the app automatically re-checks and still shows the modal once the user is fully initialized (no manual refresh required).",
        "If there is no pending invitation, the modal does not appear."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminInvitation.ts",
          "operation": "modify",
          "description": "Adjust invitation checking to be resilient to early-login authorization timing (authorization component): treat transient authorization/trap failures as retryable rather than as a definitive `false`, and configure React Query retries/delays so a pending invitation is eventually detected once the caller is fully initialized. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the modal auto-open logic to avoid being gated by an early, transient ‘false’ invitation result; ensure the modal opens as soon as the invitation query resolves true after login without requiring navigation or refresh. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "After accepting an admin invitation, update cached role state so the Admin Panel button becomes visible immediately (same session) without refresh; declining clears the invitation and closes the modal.",
      "acceptanceCriteria": [
        "After clicking “Accept & Become Admin”, the backend assigns the admin role to the caller and clears the invitation.",
        "After acceptance completes, the invitation modal closes and the top-bar “Admin Panel” button appears during the same session without a manual reload.",
        "After clicking “Decline”, the backend clears the invitation and the modal closes; the user does not become admin."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useAdminInvitation.ts",
          "operation": "modify",
          "description": "Ensure the accept/decline mutations invalidate and refetch all role-related queries needed for immediate UI updates (admin status + invitation status), aligned with the authorization component’s role-check behavior, so the header reacts without reload. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/admin/AdminInvitationModal.tsx",
          "operation": "modify",
          "description": "After a successful accept/decline action, ensure the modal closes reliably and does not reopen from stale state while role/invitation queries refetch; keep existing UI components composed (do not edit ui library files). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Confirm the header’s “Admin Panel” visibility reacts to the post-accept refetch of admin status during the same session (no refresh), including in the mobile menu. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}