{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Remove admin link flash and harden /admin route gating",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Render the “Admin Panel” navigation entry only after the admin check has completed and confirmed admin status (no flash for non-admins).",
      "acceptanceCriteria": [
        "When logged out, no Admin Panel entry is visible.",
        "When logged in as a non-admin, no Admin Panel entry is visible at any time (no flash during loading).",
        "When logged in as an admin, the Admin Panel entry appears and remains clickable.",
        "The mobile and desktop navigation follow the same admin-visibility rules."
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Update the header navigation gating logic so the Admin Panel button/link is not rendered while admin status is still loading (remove the current behavior that shows it during loading). Gate rendering strictly on: user is authenticated AND the admin check has completed AND isAdmin is true; apply the same rule to both desktop and mobile nav so non-admin users never see a flash."
        },
        {
          "path": "frontend/src/hooks/useAdmin.ts",
          "operation": "modify",
          "description": "Tighten the admin-check hook's returned state semantics (isLoading/isFetched) so callers can reliably gate UI without transient flashes (e.g., ensure isFetched only becomes true after a check has actually been performed for the current authenticated identity, and isLoading correctly reflects actor dependency + query loading)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Protect the /admin route in the UI with clear states for logged-out, non-admin, and admin users (including manual hash navigation).",
      "acceptanceCriteria": [
        "Visiting `#/admin` while logged out shows an “Admin Access Required” login prompt.",
        "Visiting `#/admin` while logged in as a non-admin shows an “Access Denied” screen.",
        "Visiting `#/admin` while logged in as an admin shows the admin dashboard content."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/admin/AdminAccessGate.tsx",
          "operation": "modify",
          "description": "Improve AdminAccessGate to avoid incorrect transient states during Internet Identity initialization (e.g., show a neutral loading/initializing state while auth is initializing), then: if unauthenticated show the existing “Admin Access Required” login prompt; if authenticated and admin check completes false show the existing “Access Denied” screen; if admin true render children."
        },
        {
          "path": "frontend/src/pages/admin/AdminOrdersPage.tsx",
          "operation": "modify",
          "description": "Ensure the admin dashboard content remains wrapped by AdminAccessGate so manual navigation to #/admin is always gated; keep behavior consistent with the updated gate states (logged out prompt, non-admin denied, admin content)."
        },
        {
          "path": "frontend/src/pages/admin/AdminOrderDetailsPage.tsx",
          "operation": "modify",
          "description": "Ensure the admin order-details view remains wrapped by AdminAccessGate so manual navigation to #/admin/orders/:id is always gated; keep behavior consistent with the updated gate states (logged out prompt, non-admin denied, admin content)."
        }
      ]
    }
  ]
}