{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Show authenticated user's Principal ID in Home footer with copy control",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Show the authenticated user's Principal ID at the bottom of the Home page only.",
      "acceptanceCriteria": [
        "When not logged in, no Principal ID is shown anywhere on the Home page.",
        "When logged in, the Home page shows a clearly labeled value (e.g., \"Principal ID:\") containing identity.getPrincipal().toText().",
        "The Principal ID display is visually placed at the bottom of the Home page (in or directly above the global footer) and does not overlap other content on mobile or desktop.",
        "The Principal ID display appears only on the Home route and does not appear on Order, Prices, Profile, My Orders, or Admin pages."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PrincipalIdFooterBlock.tsx",
          "operation": "create",
          "description": "Create a small, self-contained footer UI block that reads the authenticated Internet Identity from the authorization component (useInternetIdentity) and renders a labeled Principal ID string using identity.getPrincipal().toText() only when identity is present. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Wire the PrincipalIdFooterBlock into the global footer but guard rendering so it appears only when currentRoute is 'home' (and relies on the block itself to render nothing if not authenticated), ensuring it is placed at the bottom/footer area and does not affect other routes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Add copy-to-clipboard control next to the displayed Principal ID with success/failure feedback.",
      "acceptanceCriteria": [
        "Clicking the copy control copies the exact Principal ID text to the clipboard.",
        "After copying, the UI shows an English success message (e.g., \"Copied\").",
        "If clipboard copy fails, the UI shows an English error message (e.g., \"Copy failed\")."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PrincipalIdFooterBlock.tsx",
          "operation": "modify",
          "description": "Implement a one-click copy control adjacent to the Principal ID that uses the browser clipboard API to copy the exact Principal ID text, and render English success/error feedback states for copy result. Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-3",
      "summary": "Isolate the Principal ID display into an easily removable UI block.",
      "acceptanceCriteria": [
        "The Principal ID display code is confined to a single, clearly named component or guarded block.",
        "Removing that component/block fully removes the Principal ID display without breaking the global footer layout or navigation."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/PrincipalIdFooterBlock.tsx",
          "operation": "modify",
          "description": "Ensure the Principal ID display, copy behavior, and feedback UI are fully contained within this single component, with minimal/clean props and a clear internal guard that returns null when not authenticated, so deleting this file and its import removes the feature without impacting other footer content."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Keep the wiring to a single import and a single guarded render location in the footer so the feature can be removed by deleting the import and JSX block without affecting footer layout or navigation."
        }
      ]
    }
  ]
}