{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "App includes role-based access for user profiles and an admin panel; current focus is fixing role-assignment logic to avoid a circular dependency that blocks profile saving and admin access.",
  "architectural_notes": [
    "Fix RBAC circular dependency: profile saving currently requires 'user' role, but 'user' role is only granted after profile save; update flow to grant 'user' role on first authenticated login."
  ],
  "known_issues": [
    "Authenticated users can be blocked from saving a profile due to a circular role requirement (must have 'user' role to save profile, but role is granted only after saving)."
  ],
  "isFixRequest": true,
  "existing_features": [
    {
      "id": "feature-on-the-frontend-automatically-invoke-the-new-backend-ensure-user-role-method-immediately-after-a-successful-internet-identity-login-and-whenever-the-authenticated-actor-becomes-available-then-invalidate-refetch-profile-and-admin-related-react-query-caches-as-needed-so-ui-state-updates-without-requiring-a-manual-page-refresh",
      "title": "On the frontend, automatically invoke the new backend \"ensure user role\" method immediately after a successful Internet Identity login (and whenever the authenticated actor becomes available), then invalidate/refetch profile and admin-related React Query caches as needed so UI state updates without requiring a manual page refresh.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Auto-assign the 'user' role to any authenticated user on first login to prevent profile-save deadlock",
      "reqIds": [],
      "status": "in_progress"
    },
    {
      "id": "AR-2",
      "summary": "Fix the circular authorization dependency that blocks new authenticated users from saving their profile by ensuring any authenticated caller is automatically granted the '#user' role on first login (or first authenticated interaction).",
      "reqIds": [
        "REQ-1"
      ],
      "status": "pending"
    },
    {
      "id": "AR-3",
      "summary": "Add a dedicated backend method that the frontend can call after Internet Identity login to ensure the caller has the '#user' role (idempotent; safe to call multiple times), and use it as the primary mechanism to bootstrap the user role.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Auto-assign 'user' role on first authenticated login to fix profile-save deadlock",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}